{"rss":{"@version":"2.0","channel":{"atom:link":[{"@href":"https:\/\/medium.com\/feed\/tyson-reeders-case-studies","@rel":"self","@type":"application\/rss+xml"},{"@href":"http:\/\/medium.superfeedr.com","@rel":"hub"}],"title":"Tyson Reeder’s Case Studies - Medium","description":"Case studies of Tyson Reeder’s work - Medium","link":"https:\/\/medium.com\/tyson-reeders-case-studies?source=rss----89e86fc4845---4","image":{"url":"https:\/\/cdn-images-1.medium.com\/proxy\/1*TGH72Nnw24QL3iV9IOm4VA.png","title":"Tyson Reeder’s Case Studies - Medium","link":"https:\/\/medium.com\/tyson-reeders-case-studies?source=rss----89e86fc4845---4"},"generator":"Medium","lastBuildDate":"Sun, 04 Mar 2018 21:20:38 GMT","webMaster":"yourfriends@medium.com","item":[{"dc:creator":"Tyson D. Reeder","content:encoded":"<p>Something that my team has maintained as a passion project is a Digital Style Guide which we referred to as the Design Guide.<\/p><p>As the amount of digital properties expands at Mutual of Omaha it became very apparent that we needed more than just a Bootstrap system. From versions 1–3.1 we had a list of components and code examples, but this left the door too open and we noticed inconsistencies in what was being created using it. We decided we needed something more going forward. We needed a Digital Design System.<\/p><p>In late 2017 a group was put together to work on building out the Digital Design System. The team consisted of a Product Owner, a lead designer that was also an Interaction Designer, two developers and two visual designers. I was one of the visual designers.<\/p><p>The main goal of the Digital Design System was to create a tool for developers and designers to be able to reference when designing and building that would help keep things more consistent and match the new design standards set in place with MutualofOmaha.com.<\/p><p>At this time the Design Guide was in version 3.1.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*braii9Exy_M1wtY02NTHjA.gif\" \/><figcaption>Design Guide 3.1<\/figcaption><\/figure><p>We had a few goals with the new system:<\/p><ol><li>More documentation. We wanted to make it easier for developers to make more informed design decisions when a designer couldn’t be dedicated to a project.<\/li><li>Less layers of navigation to get to what you need. This was something we heard from developers and something we had experienced. It was sometimes hard to find things on the current site.<\/li><li>Help educate about ADA requirements and provide accessible components to give partners a better start.<\/li><li>Provide templates to get projects jump started.<\/li><\/ol><p>We started by auditing many of our larger projects to see what was out in the wild.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*0lH1IF7Ui11IO5Q6jwMD6A.png\" \/><figcaption>Buttons UI Audit<\/figcaption><\/figure><p>This was a great exercise because it showed us how things were being used and how many variations were out there.<\/p><p>After we had done the audits we started working our way through the list of items we needed and what we could get done for the MVP.<\/p><p>Around this time I became very busy with<a href=\"http:\/\/bit.ly\/2nKcj6g\"> another project<\/a> and wasn’t able to help much other than answer questions and guide some decisions.<\/p><p>After my project wrapped up I jumped back on the Digital Design System Team to help them build out the site.<\/p><p>I worked on the layout of the site and helped get sections built out.<\/p><p>You can <a href=\"http:\/\/bit.ly\/2GZT1lw\">see the Digital Design System here<\/a>.<\/p><p>Thankfully, a team will be dedicated to maintaining and evolving the Digital Design System. So this is only the beginning.<\/p><h4>My Roles on this project<\/h4><p>Visual Designer and pseudo-Copywriter (helped write some of the documentation)<\/p><img src=\"https:\/\/medium.com\/_\/stat?event=post.clientViewed&referrerSource=full_rss&postId=2cc9887ca124\" width=\"1\" height=\"1\"><hr><p><a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\/mutual-of-omaha-digital-design-system-2cc9887ca124\">Mutual of Omaha Digital Design System<\/a> was originally published in <a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\">Tyson Reeder’s Case Studies<\/a> on Medium, where people are continuing the conversation by highlighting and responding to this story.<\/p>","atom:updated":"2018-03-04T21:04:08.850Z","title":"Mutual of Omaha Digital Design System","link":"https:\/\/medium.com\/tyson-reeders-case-studies\/mutual-of-omaha-digital-design-system-2cc9887ca124?source=rss----89e86fc4845---4","guid":{"@isPermaLink":"false","$":"https:\/\/medium.com\/p\/2cc9887ca124"},"category":["design-systems","design"],"pubDate":"Sun, 04 Mar 2018 21:04:08 GMT"},{"dc:creator":"Tyson D. Reeder","content:encoded":"<p>In Q3 I heard about a Senior Health initiative to create an “Advice Engine” for Medicare. The project was an enterprise initiative to give our customers unbiased information about Medicare and was one of the milestones that needed to be hit for 2017.<\/p><p>The company had partnered with Primacy, a digital agency, to help with the concept testing and the initial design. Since the tool would ultimately live inside mutualofomaha.com I was put on the project to oversee the work.<\/p><p>Primacy is excellent to work with. We had working sessions to flush out concepts and they would contact me when needed via Slack. They worked like an extension of our team.<\/p><p>The design was coming together.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*CEHc6e6COCLUqEOyC0ONkg.png\" \/><figcaption>Design for the Medicare Advice Center<\/figcaption><\/figure><p>As the design was being built we reached out to the Customer Insights group to test some naming concepts with customers. We tested many names, but ultimately the name that matched up the most with what we were trying to build was the “Advice Center”. So the “Medicare Advice Center” was born.<\/p><p>It was also determined that Primacy would develop the “Medicare Advice Center” and that we would help implement it into mutualofomaha.com. So, a UX Developer on my team joined the project.<\/p><p>We worked closely with Primacy and integrated their code into our environment piece by piece.<\/p><p>I helped with content population and any sort of visual polish that was necessary. As well as, helping squash as many bugs as I could.<\/p><p>I also, took on the task of filing the Advice Center with the states and handled objections as they arose. The goal was to be live in as many states as possible by the end of the year. And honestly, we thought we would be lucky to have 10 states approve. I am happy to say, <strong>we launched the Advice Center in 37 states on December 18th 2017!<\/strong><\/p><p>It is out in the wild now and we are planning to do some marketing to help drive more traffic to the tool. Today we are sitting at about 30 users a day without any promotion.<\/p><p>We will be running usability tests soon on the production site to see what areas are tripping up our customers and what content we are missing. This was just the first phase and it will be exciting to see how the Medicare Advice Center evolves.<\/p><p><a href=\"https:\/\/www.mutualofomaha.com\/advice\/advice-center\/medicare-questions\">Visit the Medicare Advice Center<\/a><\/p><h4>My Roles on this project<\/h4><p>Visual Designer, Interaction Designer, Front-End Developer (HTML, CSS, JSON).<\/p><img src=\"https:\/\/medium.com\/_\/stat?event=post.clientViewed&referrerSource=full_rss&postId=9ddc0d343086\" width=\"1\" height=\"1\"><hr><p><a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\/medicare-advice-center-9ddc0d343086\">Medicare Advice Center<\/a> was originally published in <a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\">Tyson Reeder’s Case Studies<\/a> on Medium, where people are continuing the conversation by highlighting and responding to this story.<\/p>","atom:updated":"2018-02-14T04:59:19.927Z","title":"Medicare Advice Center","link":"https:\/\/medium.com\/tyson-reeders-case-studies\/medicare-advice-center-9ddc0d343086?source=rss----89e86fc4845---4","guid":{"@isPermaLink":"false","$":"https:\/\/medium.com\/p\/9ddc0d343086"},"category":["advice","ux","design","medicare"],"pubDate":"Wed, 14 Feb 2018 04:53:14 GMT"},{"dc:creator":"Tyson D. Reeder","content:encoded":"<p>On May 15th 2017 Mutual of Omaha was set to launch a brand new marketing campaign. Complete with a television commercial, billboards, digital ads and radio ads the campaign was set to be pretty large. Along with the campaign there was to be a new corporate website with an improved IA and a new look and feel on top of existing content. In July of 2016 I was appointed as lead Visual Designer on the project and in August 2016 we kicked off the project.<\/p><p>From a visual and interaction standpoint I had a few things I wanted to make sure were addressed in the redesign. So I worked with the team to set some design principles.<\/p><ol><li>We wanted to reduce the color palette and use color only where necessary. With a focus on high contrast to ensure readability since we were targeting an older demographic.<\/li><li>We wanted clear calls to action and better button hierarchy.<\/li><li>We wanted to design in a way that would meet WCAG 2.0 Level AA ADA requirements.<\/li><li>We wanted to freshen the brand and stand out among competitors.<\/li><\/ol><p>When we began the project Mutualofomaha.com looked like the image below. We were suffering from an identity crisis. We had our work cut out for us.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*ujqBBDl0UwSycANMKSoPxQ.jpeg\" \/><figcaption>Screenshots of different pages on Mutualofomaha.com before the May 15th redesign.<\/figcaption><\/figure><p>We started by conducting stakeholder interviews and due to timing restrictions it was decided by leadership that we would not have time to interview customers. Even though this was not how my team would of liked things to work out, we pivoted and created proto-personas to help inform decisions.<\/p><p>After we had an idea of who we were building the site for and the stakeholder vision we started working on the information architecture. For this we leaned heavily on an IA specialist at the agency. We met with her and worked through the IA which we used to inform the wireframes.<\/p><p>We tested different versions of wireframes and navigation with customers.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*gdeWerBfGf76QY5-wc6zWw.png\" \/><figcaption>Example of wireframe that was tested<\/figcaption><\/figure><p>Once the wireframe for the homepage was established we moved to interior pages.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*nyRJ9KINHYNxAXtibuyJcQ.gif\" \/><figcaption>Initial wireframes for interior pages.<\/figcaption><\/figure><p>This is where things got hairy. We were told the scope of the project was existing content with a new visual presentation and some updated navigation and IA.<\/p><p>It was becoming apparent that this might be a problem so we raised the concern and kept moving on.<\/p><p>Up until this point there hadn’t been much talk of what the new look and feel for the brand was going to be. It had been communicated to us that the commercial would drive the new branding. I quickly realized that we could not wait for the commercial and that we needed to figure out the feel of the brand as soon as possible to be able to move forward. So we got together with the agency and after a little back and forth we landed on a decision right around Christmas.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*S-u8VejNvEcscKMTPEg2VQ.png\" \/><figcaption>Please disregard the broken text styles on the buttons.<\/figcaption><\/figure><p>Now that we had a brand guideline we needed to get homepage mockups ready for presentation to the C-level leadership. We worked with the agency to come up with three concepts to present.<\/p><p>Ultimately we landed on these. Two concepts that were a blend of our design ideas (first two)and one that just my team put together (far right):<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*b1hb9mvcnhQMKMF5TzyPSw.png\" \/><figcaption>Three homepage concepts.<\/figcaption><\/figure><p>If you go to mutualofomaha.com today I bet you can tell which one won. It was the first one.<\/p><p>From there my team focused on creating internal product pages. We wanted to create templates for the pages so that we could maintain consistency across the site. When trying to do this with the existing content we realized that it was going to clutter the site and that content needed to be discarded and some new content would need to be written.<\/p><p>Due to the short deadline we had to move through product sections fast to get them to states for approval.<\/p><p>We knew traditional ways of moving work through the company for approval would not cut it. If we were going to move through sections fast we needed to get everyone in a room and handle concerns right then and there.<\/p><p>So we started the new workflow. At the beginning of the week we would provide writing templates to the writers for 4 products. We would then take the content they wrote and apply it in the template around the middle of the week. Then towards the end of the week we would have a “pizza party” where we would invite stakeholders, product and compliance into a large room to review the pages. We would handle any easy changes in that meeting and make sure concerns were handled. Then we would finish up getting the sections ready for state approval and send them on their way. The next week the cycle would start over until we got through all the products.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*Uk1XOrg9bpv4irT1fgfR6g.png\" \/><figcaption>Example of Product Basics template<\/figcaption><\/figure><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*9Pxm1DZ8mpOY0TtaXeQGAw.png\" \/><\/figure><p>It was fast passed and there was never a dull moment, but it is what made the redesign such a success.<\/p><p>Once product sections were done we moved on to the other sections of the site. We enlisted Primacy to help us build out some of these sections.<\/p><p>As we were designing pages the developers were building them. We all colocated into a room on the lower level and the team grew substantially. We had many long hours and many problems to solve on the fly, but we hit the deadline and launched the site with very few bugs.<\/p><p>You can see the end product of all that work here: mutualofomaha.com<\/p><h3>Roles on this project<\/h3><p>Visual Designer, Front-End Developer<\/p><img src=\"https:\/\/medium.com\/_\/stat?event=post.clientViewed&referrerSource=full_rss&postId=defe19730943\" width=\"1\" height=\"1\"><hr><p><a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\/mutual-of-omaha-com-redesign-defe19730943\">Mutual of Omaha.com Redesign<\/a> was originally published in <a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\">Tyson Reeder’s Case Studies<\/a> on Medium, where people are continuing the conversation by highlighting and responding to this story.<\/p>","atom:updated":"2018-02-14T04:52:22.632Z","title":"Mutual of Omaha.com Redesign","link":"https:\/\/medium.com\/tyson-reeders-case-studies\/mutual-of-omaha-com-redesign-defe19730943?source=rss----89e86fc4845---4","guid":{"@isPermaLink":"false","$":"https:\/\/medium.com\/p\/defe19730943"},"category":["ux","design-process","redesign","design"],"pubDate":"Wed, 14 Feb 2018 04:52:22 GMT"},{"dc:creator":"Tyson D. Reeder","content:encoded":"<p>One of my early projects at Mutual of Omaha was working on a web app that allowed our sales professionals outside the office to access data, that was previously unattainable while on the road.<\/p><p>A proof of concept had been built by our IT department and deployed to the sales distributions with one major problem…No one was using it.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*bHvln9zP6iBpQ6P-TxjSlg.png\" \/><figcaption>The proof of concept that was released looked like this. It was thought that this would be a site that housed a lot of important sales information.<\/figcaption><\/figure><p>Their plan was to revisit the proof of concept and develop a more in-depth reporting tool inside of it.<\/p><p>When the team came to my team I was presented with these ideas of how the tool could work. They told me that just needed me to make it look nicer and work on the UI.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/720\/1*m0P4Vn0PhVAtKDwH_V3-Qw.jpeg\" \/><figcaption>A screen of what they thought should be built.<\/figcaption><\/figure><p>Once I learned that the real problem was that they had a tool out there that wasn’t being utilized I knew I needed to educate the team on the importance of user interviews and usability testing. The product owner saw the value in this work and how it would help him create a useful tool. I joined the team and played the roles of Visual Designer, Interaction Designer and Front-End Developer.<\/p><p>We conducted stakeholder and user interviews. From there we developed a persona and scenario to work towards.<\/p><p>A few key things emerged as very important for both stakeholders and users<br>1. The tool had to house up-to-date and reliable information. This was very important because in the past users found it hard to trust the data that was being distributed to them.<br>2. The tool needed to be mobile friendly.<br>3. It needed to help make quick, informed business decisions.<br>4. The tool needed to get them to what they wanted to quick.<\/p><p>We set out to build the tool they needed.<\/p><h4>The polished design<\/h4><p>We tested some rough prototypes with the user which helped polish our design idea. I took this information and designed the interface.<\/p><p>I wanted to give the user a snapshot of how things were running and let them dive in from there. I hoped to show goals in a very visual way to let them quickly know where they stood. Also I felt it was very important for them to understand the time period of the data.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*JiSmTlFjMbL5QHtlDp0xYw.png\" \/><\/figure><p><em>Release 1–1.2 happened before I was a part of the project<\/em><\/p><h4>Release 2<\/h4><p>Since I was brought on later rather than earlier, a lot of the database structure had already been built. So I did what I could to implement the initial design in the short time frame.<\/p><p>The user could pick between a few dashboards to see high level information pertaining to that constraint. From there they could drill down into the hierarchy of information on the right half of the screen.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*q9JuwA-LoOtFfI5QuLJbAw.png\" \/><\/figure><h4>Release 2.1<\/h4><p>Release 2 was a good first stab at getting the users the information they needed, but it was tedious to navigate the data. With Release 2.1 we added the ability to filter the vast amount of data to the things they wanted to see.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*F2ydjAj2NGjD6FtHbQtVEQ.png\" \/><\/figure><p>The user could Filter, Exclude and Compare data on the different reports.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*gr9d0nkWXti6IQYzAu2l3A.png\" \/><\/figure><h4>Release 3<\/h4><p>From testing it became very apparent that the idea of global filters vs section filters was not understood by the users. With this release we removed this confusion and created one filter button, something I had suggested at the beginning of the project. The name “compare” did not seem to resonate with the users so I renamed it to “Breakdown Numbers” a phrase that many had said during our testing. I continued to polish the design and test with users. We also broke this functionality out into its own button.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*l9XZbSeAjhOBLnIabkjTyA.png\" \/><\/figure><h4>Release 3.1 (in-progress)<\/h4><p>Our next release will add the ability to edit reports, add new role reports and restructure the way we display our data.<\/p><p>I have been testing the latest release with our users and there is a lot of excitement around it. We learned that, while we gave them tools to do what they needed to in previous releases, they would have to invest some time and play around with which filters to add and how they should manipulate the data. <strong>This was something the majority would not do<\/strong>. So we adjusted.<\/p><p>We talked with some key users to learn what is the data that can help them do their job better. There was a lot of overlap between people and roles so we started building steps to quickly get them to this data.<\/p><p>We created a set of reports with the focus of seeing how a broker is running with Mutual of Omaha.<\/p><p>Here is that interaction:<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*7NwlxB2EzILKRk8IWYspAw.jpeg\" \/><figcaption>After selecting the “Broker Overview” we just need to know the broker they are interested in learning more about<\/figcaption><\/figure><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*7V5R2pGPeZ6QFV8Zk8vJVg.jpeg\" \/><figcaption>They are then presented with a screen that gives them a high level understanding of the broker<\/figcaption><\/figure><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*B5mIanoTrHwjV53XX_gvXQ.jpeg\" \/><figcaption>From there they can drilldown into the information and we show them what they are looking for at each stage.<\/figcaption><\/figure><p>By talking with the users we were able to understand what they need when they need it. The broker overview was created because many times they just want to be able to see how a specific broker is running. Instead of making them think of how to filter down to this data we just ask them one question and we handle the rest. These reports along with saving of customized reports are some of the most valuable additions we have made to the application for our users.<\/p><p>I joined the project in April of 2014 and since then usage has been steady. We have many users checking the application frequently and returning often. I will be leaving the project by the end of September, but the team has a strong framework to build upon. Overall, I would say the project has been a success and a great learning experience for all involved.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*As8zcoFeeL7aD7_-Ac80nQ.png\" \/><figcaption>Analytics for the different releases. It would only go back to November 7th 2014.<\/figcaption><\/figure><p>Also, here is a GIF showing how the application is responsive.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*cwtr6Ufm_G7ryWxmZIWGVw.gif\" \/><\/figure><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*ozL36M3OGGIEdjG42ykvgQ.jpeg\" \/><\/figure><h4>My Roles on this project<\/h4><p>Visual Designer, Interaction Designer, Front-End Developer (HTML, CSS, Angular manipulation in HTML) and Copywriter (for the communication the copy was started by me).<\/p><p><em>At the beginning of the project I had two different Interaction Designers helping, but they got pulled off the project.<\/em><\/p><img src=\"https:\/\/medium.com\/_\/stat?event=post.clientViewed&referrerSource=full_rss&postId=6b7dbc5c8514\" width=\"1\" height=\"1\"><hr><p><a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\/sales-reporting-web-application-6b7dbc5c8514\">Sales Reporting Web Application<\/a> was originally published in <a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\">Tyson Reeder’s Case Studies<\/a> on Medium, where people are continuing the conversation by highlighting and responding to this story.<\/p>","atom:updated":"2018-02-08T14:51:02.718Z","title":"Sales Reporting Web Application","link":"https:\/\/medium.com\/tyson-reeders-case-studies\/sales-reporting-web-application-6b7dbc5c8514?source=rss----89e86fc4845---4","guid":{"@isPermaLink":"false","$":"https:\/\/medium.com\/p\/6b7dbc5c8514"},"category":["ux","application","web-design"],"pubDate":"Thu, 08 Feb 2018 14:51:02 GMT"},{"dc:creator":"Tyson D. Reeder","content:encoded":"<p>When the redesigned Mutualofomaha.com was initially launched there were no sticky navigation elements. Below is a GIF that recreates what the site looked like when it was release in May of 2017.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*xJxMJ0A37NnxDnUk1HYcSw.gif\" \/><\/figure><p>We decided to tackle this problem in phases. First we made the main navigation sticky when the user scrolled.<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*vxb_mrZErXAMn8HroRpYhQ.gif\" \/><\/figure><p>But I wanted to spend some time on the secondary navigation. I felt we needed to also make the subnav stick to the top of the page to allow the user to quickly navigate between sections of the product. So, I started working on how we could accomplish this.<\/p><p>Some things I had to keep in mind:<\/p><ul><li>The contact information on the right would need to remain prominent and easy to access.<\/li><li>Sometimes we use this same area to the right to show the agent’s photo and contact information. So the new design would need to support this functionality.<\/li><li>I wanted to avoid hiding navigation items as much as possible.<\/li><\/ul><p>Some of my initial ideas:<\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*y2G5ir6d9rbJHDLPuY6QSA.png\" \/><figcaption>Exploration for the sticky subnav.<\/figcaption><\/figure><p>While I liked the idea of keeping the contact buttons exposed on the mobile device I knew we would run into a problem because of state regulation. In some states we are not allowed to call our agents “agents”. So there was a potential for “Contact an Authorized Representative” to be the CTA so we would run out of real estate quickly.<\/p><p>Ultimately I came up with the following design and worked with a developer to get it built.<\/p><p>You can see the GIFs below.<\/p><p>Or see it live on <a href=\"http:\/\/www.mutualofomaha.com\/life-insurance\">www.mutualofomaha.com\/life-insurance<\/a><\/p><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/1024\/1*EV246f-GDNbuAcfQ1RMBog.gif\" \/><figcaption>Desktop<\/figcaption><\/figure><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/864\/1*017WnYxpLPeRU0bII2q8SA.gif\" \/><figcaption>Tablet<\/figcaption><\/figure><figure><img alt=\"\" src=\"https:\/\/cdn-images-1.medium.com\/max\/390\/1*C476UmVkuhYoCFsZihwYHA.gif\" \/><figcaption>Phone<\/figcaption><\/figure><h4>My Role on this project<\/h4><p>Visual Designer<\/p><img src=\"https:\/\/medium.com\/_\/stat?event=post.clientViewed&referrerSource=full_rss&postId=d082643f9777\" width=\"1\" height=\"1\"><hr><p><a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\/mutualofomaha-com-sticky-navigation-enhancement-d082643f9777\">MutualofOmaha.com Sticky Navigation Enhancement<\/a> was originally published in <a href=\"https:\/\/medium.com\/tyson-reeders-case-studies\">Tyson Reeder’s Case Studies<\/a> on Medium, where people are continuing the conversation by highlighting and responding to this story.<\/p>","atom:updated":"2018-02-09T21:40:33.557Z","title":"MutualofOmaha.com Sticky Navigation Enhancement","link":"https:\/\/medium.com\/tyson-reeders-case-studies\/mutualofomaha-com-sticky-navigation-enhancement-d082643f9777?source=rss----89e86fc4845---4","guid":{"@isPermaLink":"false","$":"https:\/\/medium.com\/p\/d082643f9777"},"category":["design","ux"],"pubDate":"Fri, 09 Feb 2018 21:40:33 GMT"}]}}}